ls = [12,40,10,9,8,-1,21,-6]
print(f"原序列是{ls}")
print("——————————————————————————————")
#————————————————————基础数据与输出


ls = [12,40,10,9,8,-1,21,-6]
n=0
for j in range(len(ls)):
    #j的开始是0，所以下面的数为j+1
    for i in range(len(ls)-(j+1)):
        if(ls[j]>ls[i+j+1]):
                ls[j],ls[i+j+1]=ls[i+j+1],ls[j]
                n+=1
print(f"由普通选择排序法得出的结果为{ls}")
print(f"由普通选着排序法得出的交换次数为{n}")
print("——————————————————————————————")
#—————————————————————基础


ls = [12,40,10,9,8,-1,21,-6]
n=0
for j in range(len(ls)):
    f=j
    for i in range(len(ls)-(j+1)):
        if(ls[f]>ls[i+(j+1)]):
            f=i+(j+1)
    ls[j],ls[f]=ls[f],ls[j]
    n+=1
print(f"由改进型选择排序法得出的结果为{ls}")
print(f"由改进型选择排序法得出的交换次数为{n}")
print("——————————————————————————————")
#——————————————————————改进


ls = [12,40,10,9,8,-1,21,-6]
n=0
for j in range(len(ls)):
    f=j
    for i in range(len(ls)-(j+1)):
        if(ls[f]>ls[i+(j+1)]):
            f=i+(j+1)
    if(f!=j):
        ls[j],ls[f]=ls[f],ls[j]
        n+=1
print(f"由最优型选择排序法得出的结果为{ls}")
print(f"由最优型选择排序法得出的交换次数为{n}")
print("——————————————————————————————")
#——————————————————————最优

