import turtle as t
import time
import random
t.hideturtle()
#-------------------------------------------
def p(x,y):
    global k
    k=1
t.tracer(100)#拿笔，为笔上色
t1=t.Pen()
t2=t.Pen()
t1.hideturtle()
t2.hideturtle()
t1.penup()
t2.penup()
t1.pencolor("blue")
t2.pencolor("red")

k=0
#-------------------------------------------#图案表
ls=[#   1            2           3           4           5           6           7           8           9           10
    '\u264B'  ,  '\u2648',   '\u2649',   '\u264F',   '\u264E',   '\u264A',   '\u264D',   '\u2653',   '\u264C',   '\u264F',#1
    
    '\u2653'  ,  '\u264F',   '\u264B',   '\u2648',   '\u2649',   '\u264F',   '\u264E',   '\u264C',   '\u264E',   '\u264A',#2
    
    '\u2648'  ,  '\u2649',   '\u264F',   '\u2653',   '\u264B',   '\u264E',   '\u264C',   '\u264A',   '\u2652',   '\u264B',#3
    
    '\u264D'  ,  '\u2650',   '\u2652',   '\u264B',   '\u2649',   '\u264C',   '\u2648',   '\u264F',   '\u264A',   '\u264F',#4
    
    '\u264A'  ,  '\u2649',   '\u264B',   '\u2652',   '\u264C',   '\u264F',   '\u2653',   '\u2648',   '\u2653',   '\u2649',#5
    
    '\u2649'  ,  '\u264D',   '\u264F',   '\u264C',   '\u2648',   '\u2650',   '\u264E',   '\u2651',   '\u264E',   '\u264C',#6
    
    '\u2652'  ,  '\u2649',   '\u264C',   '\u2648',   '\u264B',   '\u264A',   '\u2650',   '\u264F',   '\u264E',   '\u264D',#7
    
    '\u264E'  ,  '\u264C',   '\u2648',   '\u2649',   '\u264F',   '\u264B',   '\u264F',   '\u2653',   '\u264D',   '\u264E',#8
    
    '\u264C'  ,  '\u264F',   '\u264E',   '\u264D',   '\u2648',   '\u2649',   '\u264B',   '\u2652',   '\u264F',   '\u264C',#9

    '\u264D'  ,  '\u2650',   '\u2652',   '\u264B',   '\u2649',   '\u264C',   '\u2648',   '\u264F',   '\u2653',   '\u264A'#10    
    ]

#------------显示标题----------------
t2.pu()
t2.goto(-610,350)
t2.fd(200)
t2.write("记好您所选数字(10-99)，分别减去其个位与十位，找到对应图案，牢记于心。",font=('宋体',18))
t2.pu()
t2.goto(-420,320)
t2.fd(200)
t2.write("点击屏幕，您将会看到心中数字对应的图案。",font=('宋体',18))
#-----------------------------------

b=random.randint(0,99)#随机出9的倍数图案对应编号
for m in range(10):
    for i in range(10):
        g=10*m+i#便于判定9的倍数
        a=random.randint(0,99)#随机出各位置对应图案编号
        t1.pu()
        t1.goto(-230+50*i,290-70*m)
        t1.pd()
        t1.write(g,font=('宋体',10))
        t1.pu()
        t1.goto(-250+50*i,240-70*m)
        t1.pd()       
        if(g%9==0):
            t1.write(ls[b],font=('宋体',40))#为9的倍数设置同一图案
        else:
            t1.write(ls[a],font=('宋体',40))#余下图案

#------------------------------------
t.onscreenclick(p)
while(True):#点击结束循环
    t.clear()
    time.sleep(0.01)
    if(k==1):
        break
t1.clear()
t2.clear()
t2.pu()
t2.goto(-450,200)
t2.fd(200)
t2.write("您的心中所想如下：",font=('宋体',50))#标题
t1.pu()
t1.goto(-250,-400)
t1.pd()
t1.write(ls[b],font=('宋体',400))#最后图案

