import pandas as pd

my_dict = {'9787572218194': '四级词汇书',
           '9787544653114': '听力练习上册',
           '9787544654166': '听力练习下册',
           '9787530217610': '《兄弟》',
           '9787530221099': "《文城》"}
print(pd.DataFrame.from_dict(my_dict))
my_dict = {{'id': '9787572218194', 'name': '四级词汇书'},
               {'id': '9787544653114', 'name': '听力练习上册'},
               {'id': '9787544654166', 'name': '听力练习下册'},
               {'id': '9787530217610', 'name': '《兄弟》'},
               {'id': '9787530221099', 'name': "《文城》"}}