import random
import turtle as t

t.tracer(False)

a = random.randint(1, 10)
print(a)


def move(x, y):
    t.penup()
    t.goto(x, y)
    t.pendown()
    t.seth(0)


pk = ["红心A", "红心2", '红心3', '红心4', '红心5',
      '红心6', '红心7', '红心8', '红心9', '红心10',
      '红心J', '红心Q', '红心K', '方块A', '方块1',
      '方块2', '方块3', '方块4', '方块5', '方块6',
      '方块7', '方块8', '方块9', '方块10', '方块J',
      '方块Q', '方块K', '黑桃A', '黑桃1', '黑桃2',
      '黑桃3', '黑桃4', '黑桃5', '黑桃6', '黑桃7',
      '黑桃8', '黑桃9', '黑桃10', '黑桃J', '黑桃Q',
      '黑桃K', '梅花A', '梅花2', '梅花3', '梅花4',
      '梅花5', '梅花6', '梅花7', '梅花8', '梅花9',
      '梅花10', '梅花J', '梅花Q', '梅花K']

ch1 = '\u2665'
ch2 = '\u2660'
ch3 = '\u2666'
ch4 = '\u2663'
t.write("杨山峰", font=("微软雅黑", 12, "normal"))
t.mainloop()